Kubernetes/cloudlab/results/30-05-24 copy/12/hotelReservation/1/k8s-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client-t8-c512-d30-R1000-N1
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=1000
Running 30s test @ http://localhost:5000
  8 threads and 512 connections
  Thread calibration: mean lat.: 3.339ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.353ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.312ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.326ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.215ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.325ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.386ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.233ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.31ms    1.45ms   7.83ms   74.80%
    Req/Sec   131.56    116.66   454.00     58.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.85ms
 75.000%    4.07ms
 90.000%    5.36ms
 99.000%    7.83ms
 99.900%   10.32ms
 99.990%   11.34ms
 99.999%   12.46ms
100.000%   12.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.079     0.000000            1         1.00
       1.873     0.100000         1996         1.11
       2.143     0.200000         3989         1.25
       2.355     0.300000         6002         1.43
       2.563     0.400000         7988         1.67
       2.847     0.500000         9981         2.00
       3.053     0.550000        10969         2.22
       3.293     0.600000        11966         2.50
       3.539     0.650000        12965         2.86
       3.789     0.700000        13959         3.33
       4.075     0.750000        14952         4.00
       4.239     0.775000        15457         4.44
       4.415     0.800000        15949         5.00
       4.615     0.825000        16450         5.71
       4.823     0.850000        16957         6.67
       5.071     0.875000        17449         8.00
       5.211     0.887500        17698         8.89
       5.363     0.900000        17948        10.00
       5.523     0.912500        18192        11.43
       5.723     0.925000        18445        13.33
       5.967     0.937500        18690        16.00
       6.111     0.943750        18816        17.78
       6.255     0.950000        18940        20.00
       6.423     0.956250        19062        22.86
       6.599     0.962500        19190        26.67
       6.779     0.968750        19313        32.00
       6.863     0.971875        19374        35.56
       6.951     0.975000        19436        40.00
       7.119     0.978125        19498        45.71
       7.271     0.981250        19561        53.33
       7.415     0.984375        19625        64.00
       7.499     0.985938        19655        71.11
       7.603     0.987500        19685        80.00
       7.747     0.989062        19716        91.43
       7.935     0.990625        19748       106.67
       8.199     0.992188        19780       128.00
       8.279     0.992969        19794       142.22
       8.375     0.993750        19811       160.00
       8.447     0.994531        19825       182.86
       8.583     0.995313        19841       213.33
       8.775     0.996094        19858       256.00
       8.863     0.996484        19864       284.44
       8.967     0.996875        19873       320.00
       9.087     0.997266        19880       365.71
       9.295     0.997656        19888       426.67
       9.463     0.998047        19896       512.00
       9.567     0.998242        19899       568.89
       9.655     0.998437        19904       640.00
       9.743     0.998633        19907       731.43
       9.815     0.998828        19911       853.33
      10.351     0.999023        19915      1024.00
      10.423     0.999121        19917      1137.78
      10.535     0.999219        19919      1280.00
      10.559     0.999316        19921      1462.86
      10.639     0.999414        19923      1706.67
      10.727     0.999512        19925      2048.00
      10.839     0.999561        19926      2275.56
      10.895     0.999609        19927      2560.00
      10.983     0.999658        19928      2925.71
      11.047     0.999707        19929      3413.33
      11.111     0.999756        19930      4096.00
      11.111     0.999780        19930      4551.11
      11.191     0.999805        19931      5120.00
      11.191     0.999829        19931      5851.43
      11.343     0.999854        19932      6826.67
      11.343     0.999878        19932      8192.00
      11.343     0.999890        19932      9102.22
      11.367     0.999902        19933     10240.00
      11.367     0.999915        19933     11702.86
      11.367     0.999927        19933     13653.33
      11.367     0.999939        19933     16384.00
      11.367     0.999945        19933     18204.44
      12.463     0.999951        19934     20480.00
      12.463     1.000000        19934          inf
#[Mean    =        3.313, StdDeviation   =        1.453]
#[Max     =       12.456, Total count    =        19934]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29656 requests in 30.00s, 12.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 156
Requests/sec:    988.42
Transfer/sec:    417.05KB